In [13]:
import pandas as pd
import numpy as np

In [ ]:
#creating a series

In [5]:
s=pd.Series()

In [6]:
s

Series([], dtype: object)

In [11]:
s = pd.Series([0,11,22,33,44,55,66,77,88,98,100])
print(s)

0       0
1      11
2      22
3      33
4      44
5      55
6      66
7      77
8      88
9      98
10    100
dtype: int64

In [12]:
s = pd.Series([100,15.37,'satvi'])
print(s)

0      100
1    15.37
2    satvi
dtype: object

In [14]:
#creating dictionary

In [31]:
d={'ID':[6,7,8],'AGE':[15,28,19],'SCORE':[58,86,97]}

In [32]:
df=pd.DataFrame(d)
print(df)

   ID  AGE  SCORE
0   6   15     58
1   7   28     86
2   8   19     97

In [35]:
df['TIME'] = "23.2:25.3:24.9".split(':')

In [36]:
print(df)

   ID  AGE  SCORE  time  TIME
0   6   15     58  23.2  23.2
1   7   28     86  25.3  25.3
2   8   19     97  24.9  24.9

In [39]:
d={'ID':[6,7,8],'AGE':[15,np.nan,19],'SCORE':[np.nan,86,97]}
d

{'ID': [6, 7, 8], 'AGE': [15, nan, 19], 'SCORE': [nan, 86, 97]}

In [40]:
df=pd.DataFrame(d)
print(df)

   ID   AGE  SCORE
0   6  15.0    NaN
1   7   NaN   86.0
2   8  19.0   97.0

In [41]:
print("excluding nan value collums")
print(df.dropna(axis=1))

excluding nan value collums
   ID
0   6
1   7
2   8

In [42]:
print(df)

   ID   AGE  SCORE
0   6  15.0    NaN
1   7   NaN   86.0
2   8  19.0   97.0

In [43]:
print("excluding nan value rows")
print(df.dropna(axis=0))

excluding nan value rows
   ID   AGE  SCORE
2   8  19.0   97.0

In [44]:
print(df)

   ID   AGE  SCORE
0   6  15.0    NaN
1   7   NaN   86.0
2   8  19.0   97.0

In [45]:
print("nan values replaced with 10")
print(df.fillna(10))

nan values replaced with 10
   ID   AGE  SCORE
0   6  15.0   10.0
1   7  10.0   86.0
2   8  19.0   97.0

In [46]:
print("replacing nan values with mean of colums")
df.fillna(value=df['AGE'].mean(),inplace=True)
print(df)

replacing nan values with mean of colums
   ID   AGE  SCORE
0   6  15.0   17.0
1   7  17.0   86.0
2   8  19.0   97.0

In [47]:
print(df)

   ID   AGE  SCORE
0   6  15.0   17.0
1   7  17.0   86.0
2   8  19.0   97.0

In [48]:
#creating dataframe

In [52]:
data={'Company':['fb','google','apple','google','fb','apple'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[500,240,490,243,304,378]}

In [53]:
df= pd.DataFrame(data)
print(df)

  Company   Person  Sales
0      fb      Sam    500
1  google  Charlie    240
2   apple      Amy    490
3  google  Vanessa    243
4      fb     Carl    304
5   apple    Sarah    378

In [54]:
bycomp = df.groupby('Company')
print(bycomp['Sales'].mean())

Company
apple     434.0
fb        402.0
google    241.5
Name: Sales, dtype: float64

In [55]:
print(bycomp['Sales'].sum())

Company
apple     868
fb        804
google    483
Name: Sales, dtype: int64

In [56]:
#working with concatination

In [57]:
class_1=pd.DataFrame({'math':[45,68,35,65],
                     'english':[54,87,36,52],
                     'science':[66,77,88,70],
                     'chem':[54,79,58,76]},
                    index=['rohit','shad','arman','abhi'])
class_1

       math  english  science  chem
rohit    45       54       66    54
shad     68       87       77    79
arman    35       36       88    58
abhi     65       52       70    76

In [67]:
class_2=pd.DataFrame({'math':[50,87,69,71],
                     'english':[66,50,87,69],
                     'science':[34,66,69,71],
                     'chem':[54,87,34,66]},
                    index=['ishaan','mahika','viral','motupalli'])
class_2

           math  english  science  chem
ishaan       50       66       34    54
mahika       87       50       66    87
viral        69       87       69    34
motupalli    71       69       71    66

In [68]:
class_3=pd.DataFrame({'math':[66,50,87,56],
                     'english':[56,87,89,71],
                     'science':[77,88,70,52],
                     'chem':[34,56,56,87]},
                    index=['aashi','arnav','sanky','dhruv'])
class_3

       math  english  science  chem
aashi    66       56       77    34
arnav    50       87       88    56
sanky    87       89       70    56
dhruv    56       71       52    87

In [69]:
#concatination

In [70]:
print("concatinated by rows")
grades=pd.concat([class_1,class_2,class_3],axis=0)
print(grades)

concatinated by rows
           math  english  science  chem
rohit        45       54       66    54
shad         68       87       77    79
arman        35       36       88    58
abhi         65       52       70    76
ishaan       50       66       34    54
mahika       87       50       66    87
viral        69       87       69    34
motupalli    71       69       71    66
aashi        66       56       77    34
arnav        50       87       88    56
sanky        87       89       70    56
dhruv        56       71       52    87

In [72]:
print("concatinating by collums")
df=pd.concat([class_1,class_2,class_3],axis=1)
print(df)

concatinating by collums
           math  english  science  chem  math  english  science  chem  math  \
rohit      45.0     54.0     66.0  54.0   NaN      NaN      NaN   NaN   NaN
shad       68.0     87.0     77.0  79.0   NaN      NaN      NaN   NaN   NaN
arman      35.0     36.0     88.0  58.0   NaN      NaN      NaN   NaN   NaN
abhi       65.0     52.0     70.0  76.0   NaN      NaN      NaN   NaN   NaN
ishaan      NaN      NaN      NaN   NaN  50.0     66.0     34.0  54.0   NaN
mahika      NaN      NaN      NaN   NaN  87.0     50.0     66.0  87.0   NaN
viral       NaN      NaN      NaN   NaN  69.0     87.0     69.0  34.0   NaN
motupalli   NaN      NaN      NaN   NaN  71.0     69.0     71.0  66.0   NaN
aashi       NaN      NaN      NaN   NaN   NaN      NaN      NaN   NaN  66.0
arnav       NaN      NaN      NaN   NaN   NaN      NaN      NaN   NaN  50.0
sanky       NaN      NaN      NaN   NaN   NaN      NaN      NaN   NaN  87.0
dhruv       NaN      NaN      NaN   NaN   NaN      NaN      NaN   NaN  56.0

           english  science  chem
rohit          NaN      NaN   NaN
shad           NaN      NaN   NaN
arman          NaN      NaN   NaN
abhi           NaN      NaN   NaN
ishaan         NaN      NaN   NaN
mahika         NaN      NaN   NaN
viral          NaN      NaN   NaN
motupalli      NaN      NaN   NaN
aashi         56.0     77.0  34.0
arnav         87.0     88.0  56.0
sanky         89.0     70.0  56.0
dhruv         71.0     52.0  87.0

In [73]:
df.fillna(0,inplace=True)
print(df)

           math  english  science  chem  math  english  science  chem  math  \
rohit      45.0     54.0     66.0  54.0   0.0      0.0      0.0   0.0   0.0
shad       68.0     87.0     77.0  79.0   0.0      0.0      0.0   0.0   0.0
arman      35.0     36.0     88.0  58.0   0.0      0.0      0.0   0.0   0.0
abhi       65.0     52.0     70.0  76.0   0.0      0.0      0.0   0.0   0.0
ishaan      0.0      0.0      0.0   0.0  50.0     66.0     34.0  54.0   0.0
mahika      0.0      0.0      0.0   0.0  87.0     50.0     66.0  87.0   0.0
viral       0.0      0.0      0.0   0.0  69.0     87.0     69.0  34.0   0.0
motupalli   0.0      0.0      0.0   0.0  71.0     69.0     71.0  66.0   0.0
aashi       0.0      0.0      0.0   0.0   0.0      0.0      0.0   0.0  66.0
arnav       0.0      0.0      0.0   0.0   0.0      0.0      0.0   0.0  50.0
sanky       0.0      0.0      0.0   0.0   0.0      0.0      0.0   0.0  87.0
dhruv       0.0      0.0      0.0   0.0   0.0      0.0      0.0   0.0  56.0

           english  science  chem
rohit          0.0      0.0   0.0
shad           0.0      0.0   0.0
arman          0.0      0.0   0.0
abhi           0.0      0.0   0.0
ishaan         0.0      0.0   0.0
mahika         0.0      0.0   0.0
viral          0.0      0.0   0.0
motupalli      0.0      0.0   0.0
aashi         56.0     77.0  34.0
arnav         87.0     88.0  56.0
sanky         89.0     70.0  56.0
dhruv         71.0     52.0  87.0

In [74]:
#merge

In [75]:
player_id_name=pd.DataFrame({'ID':[25,30,35,40,45,50,55],
                            'Name':['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri']})

In [76]:
player_detail=pd.DataFrame({'ID':[25,30,45,50,55],
                            'Age':[36,34,20,28,37],
                            'Country':['Porugal','Argentina','England','France','India']})

In [78]:
player_id_name

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [79]:
player_detail

   ID  Age    Country
0  25   36    Porugal
1  30   34  Argentina
2  45   20    England
3  50   28     France
4  55   37      India

In [81]:
print("merged")
pd.merge(player_id_name,player_detail,on='ID')

merged

   ID     Name  Age    Country
0  25  Ronaldo   36    Porugal
1  30    Messi   34  Argentina
2  45    Harry   20    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

In [82]:
#joining

In [85]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [86]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [87]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [88]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3